# DBeam_SetLShutAngle

```pascal
PROCEDURE DBeam_SetLShutAngle(angle : REAL);
```

```python
def vs.DBeam_SetLShutAngle(angle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|angle|REAL|   |

## Examples
```pascal
DBeam_SetLShutAngle(1.0);
```
```python
import vs

angle = 45.0

vs.DBeam_SetLShutAngle(angle)
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight